In [6]:
import pandas as pd
import numpy as np

In [2]:
s1 = pd.Series([10,20,30,40,50])

In [3]:
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [4]:
df1 = pd.DataFrame(s1)

In [5]:
df1

    0
0  10
1  20
2  30
3  40
4  50

In [8]:
s2 = pd.Series(np.arange(11,16))

In [9]:
s2

0    11
1    12
2    13
3    14
4    15
dtype: int32

In [11]:
pd.DataFrame([s1,s2])

    0   1   2   3   4
0  10  20  30  40  50
1  11  12  13  14  15

In [12]:
pd.DataFrame(pd.Series(np.arange(10,100,10)))

    0
0  10
1  20
2  30
3  40
4  50
5  60
6  70
7  80
8  90

In [13]:
dic1 = {
    
        "A" : 100,
        "B" : 200,
        "C" : 300,
        "D" : 400
}

In [14]:
dic1

{'A': 100, 'B': 200, 'C': 300, 'D': 400}

In [15]:
pd.Series(dic1)

A    100
B    200
C    300
D    400
dtype: int64

In [21]:
dic2 = {
    
        "NAME" : ['AAA','BBB','CCC','DDD'],
        "Class" :[10,12,11,10],
        "Computer" : [80,60,85,75],
        "Science" : [59,60,85, 90]
}

In [29]:
df_std = pd.DataFrame(dic2)

In [30]:
df_std

  NAME  Class  Computer  Science
0  AAA     10        80       59
1  BBB     12        60       60
2  CCC     11        85       85
3  DDD     10        75       90

In [26]:
dic3 = {
    
    "Name" : ["A","B","C","D"],
    "Class" : np.arange(8, 15, 2),
    "English" : pd.Series(np.random.randint(60,85,(4,)))
    
}

In [27]:
dic3

{'Name': ['A', 'B', 'C', 'D'],
 'Class': array([ 8, 10, 12, 14]),
 'English': 0    66
 1    67
 2    84
 3    83
 dtype: int32}

In [28]:
pd.DataFrame(dic3)

  Name  Class  English
0    A      8       66
1    B     10       67
2    C     12       84
3    D     14       83

#### Manipulation with DataFrame

In [31]:
df_std

  NAME  Class  Computer  Science
0  AAA     10        80       59
1  BBB     12        60       60
2  CCC     11        85       85
3  DDD     10        75       90

In [32]:
dic1

{'A': 100, 'B': 200, 'C': 300, 'D': 400}

In [33]:
dic1["E"] = 'EGG'

In [36]:
dic1["C"]

300

In [34]:
dic1

{'A': 100, 'B': 200, 'C': 300, 'D': 400, 'E': 'EGG'}

In [35]:
df_std

  NAME  Class  Computer  Science
0  AAA     10        80       59
1  BBB     12        60       60
2  CCC     11        85       85
3  DDD     10        75       90

In [37]:
df_std["Computer"]

0    80
1    60
2    85
3    75
Name: Computer, dtype: int64

In [38]:
df_std.Science

0    59
1    60
2    85
3    90
Name: Science, dtype: int64

In [39]:
df_std

  NAME  Class  Computer  Science
0  AAA     10        80       59
1  BBB     12        60       60
2  CCC     11        85       85
3  DDD     10        75       90

In [45]:
df_std["Computer"]

0    80
1    60
2    85
3    75
Name: Computer, dtype: int64

In [40]:
df_std[["Computer", "Science"]]

   Computer  Science
0        80       59
1        60       60
2        85       85
3        75       90

In [41]:
df_std

  NAME  Class  Computer  Science
0  AAA     10        80       59
1  BBB     12        60       60
2  CCC     11        85       85
3  DDD     10        75       90

In [42]:
df_std[["NAME","Computer",'Science']]

  NAME  Computer  Science
0  AAA        80       59
1  BBB        60       60
2  CCC        85       85
3  DDD        75       90

In [43]:
df_std.columns

Index(['NAME', 'Class', 'Computer', 'Science'], dtype='object')

In [44]:
df_std.index

RangeIndex(start=0, stop=4, step=1)

In [47]:
df_std["Maths"] = [90,88,69,82]

In [48]:
df_std

  NAME  Class  Computer  Science  Maths
0  AAA     10        80       59     90
1  BBB     12        60       60     88
2  CCC     11        85       85     69
3  DDD     10        75       90     82

In [50]:
df_std["Total"] = np.NaN

In [51]:
df_std

  NAME  Class  Computer  Science  Maths  Total
0  AAA     10        80       59     90    NaN
1  BBB     12        60       60     88    NaN
2  CCC     11        85       85     69    NaN
3  DDD     10        75       90     82    NaN

In [52]:
df_std["Total"] = 200

In [53]:
df_std

  NAME  Class  Computer  Science  Maths  Total
0  AAA     10        80       59     90    200
1  BBB     12        60       60     88    200
2  CCC     11        85       85     69    200
3  DDD     10        75       90     82    200

In [55]:
del df_std["Total"]

In [56]:
df_std

  NAME  Class  Computer  Science  Maths
0  AAA     10        80       59     90
1  BBB     12        60       60     88
2  CCC     11        85       85     69
3  DDD     10        75       90     82

In [57]:
df_std["Total"] = df_std["Computer"] + df_std["Science"] + df_std["Maths"]

In [58]:
df_std

  NAME  Class  Computer  Science  Maths  Total
0  AAA     10        80       59     90    229
1  BBB     12        60       60     88    208
2  CCC     11        85       85     69    239
3  DDD     10        75       90     82    247

In [59]:
df_std["Average"] = df_std["Total"] / 3

In [60]:
df_std

  NAME  Class  Computer  Science  Maths  Total    Average
0  AAA     10        80       59     90    229  76.333333
1  BBB     12        60       60     88    208  69.333333
2  CCC     11        85       85     69    239  79.666667
3  DDD     10        75       90     82    247  82.333333

In [61]:
df_std["Average"]

0    76.333333
1    69.333333
2    79.666667
3    82.333333
Name: Average, dtype: float64

In [62]:
np.round(df_std["Average"])

0    76.0
1    69.0
2    80.0
3    82.0
Name: Average, dtype: float64

In [63]:
df_std["Average"] = np.round(df_std["Average"])

In [64]:
df_std

  NAME  Class  Computer  Science  Maths  Total  Average
0  AAA     10        80       59     90    229     76.0
1  BBB     12        60       60     88    208     69.0
2  CCC     11        85       85     69    239     80.0
3  DDD     10        75       90     82    247     82.0

In [65]:
df_std["Computer"]

0    80
1    60
2    85
3    75
Name: Computer, dtype: int64

In [66]:
pd.DataFrame(df_std["Computer"])

   Computer
0        80
1        60
2        85
3        75

In [68]:
df_std[["Computer"]]

   Computer
0        80
1        60
2        85
3        75

In [69]:
df_std

  NAME  Class  Computer  Science  Maths  Total  Average
0  AAA     10        80       59     90    229     76.0
1  BBB     12        60       60     88    208     69.0
2  CCC     11        85       85     69    239     80.0
3  DDD     10        75       90     82    247     82.0

In [71]:
df_std["Average"]

0    76.0
1    69.0
2    80.0
3    82.0
Name: Average, dtype: float64

In [75]:
df_std["Grade"] = np.NaN

In [76]:
df_std

  NAME  Class  Computer  Science  Maths  Total  Average  Grade
0  AAA     10        80       59     90    229     76.0    NaN
1  BBB     12        60       60     88    208     69.0    NaN
2  CCC     11        85       85     69    239     80.0    NaN
3  DDD     10        75       90     82    247     82.0    NaN

In [77]:
import time
x = 0
for i in df_std["Average"]:
    print(i)
    if i >= 80 :
        df_std["Grade"][x] = "A"
    elif i >= 70:
         df_std["Grade"][x] = "B"
    else :
         df_std["Grade"][x] = "C"
            
    x = x + 1

76.0
69.0
80.0
82.0

C:\Users\ARJUNY~1\AppData\Local\Temp/ipykernel_7744/2345260933.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_std["Grade"][x] = "B"
C:\Users\Arjun Yadav\anaconda3\lib\site-packages\pandas\core\indexing.py:1732: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

In [78]:
df_std

  NAME  Class  Computer  Science  Maths  Total  Average Grade
0  AAA     10        80       59     90    229     76.0     B
1  BBB     12        60       60     88    208     69.0     C
2  CCC     11        85       85     69    239     80.0     A
3  DDD     10        75       90     82    247     82.0     A

In [83]:
df_std["Grade1"] = df_std["Average"].apply( lambda x :  "A" if x >= 80 else ("B" if x >= 70 else "C"))

In [84]:
df_std

  NAME  Class  Computer  Science  Maths  Total  Average Grade Grade1
0  AAA     10        80       59     90    229     76.0     B      B
1  BBB     12        60       60     88    208     69.0     C      C
2  CCC     11        85       85     69    239     80.0     A      A
3  DDD     10        75       90     82    247     82.0     A      A

In [86]:
# np.select(<condition>, <result>)

cond = [ (df_std["Average"] >= 80) , (df_std["Average"] >= 70), (df_std["Average"] < 70) ]
result = ["A","B","C"]

In [89]:
df_std["Grade2"] = np.select(cond, result)

In [90]:
df_std

  NAME  Class  Computer  Science  Maths  Total  Average Grade Grade1 Grade2
0  AAA     10        80       59     90    229     76.0     B      B      B
1  BBB     12        60       60     88    208     69.0     C      C      C
2  CCC     11        85       85     69    239     80.0     A      A      A
3  DDD     10        75       90     82    247     82.0     A      A      A

In [92]:
df_std["Grade3"] = df_std["Average"].apply( lambda x : np.where(x >= 80, "A", np.where(x>70,"B","C")))

In [93]:
df_std

,NAME,Class,Computer,Science,Maths,Total,Average,Grade,Grade1,Grade2,Grade3
0,AAA,10,80,59,90,229,76.0,B,B,B,B
1,BBB,12,60,60,88,208,69.0,C,C,C,C
2,CCC,11,85,85,69,239,80.0,A,A,A,A
3,DDD,10,75,90,82,247,82.0,A,A,A,A